# Pandas

Pandas for data manipulation.
Series for 1d
Dataframe for 2d

In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.1-cp313-cp313-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /home/aj7/Documents/workspace/github.com/thetsajeet/lab/data-science/.venv/lib/python3.13/site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/aj7/Documents/workspace/github.com/thetsajeet/lab/data-science/.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /home/aj7/Documents/workspace/github.com/thetsajeet/lab/data-science/.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp313-cp313-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.1/12.1 MB 19.5 MB/s eta 0:00:00[36m0:00:01 eta 0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.1 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 25.0 -> 25.2
[notice] To update, run: pip install --upgrade pip

In [3]:
import pandas as pd

print(pd.__version__ )

2.3.1

In [6]:
# Series

s = pd.Series([1, 2, 3, 4, 5])
print(s)
print(type(s))

dict_s = pd.Series({'a': 1, 'b': 2, 'c': 3})
print(dict_s)

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

In [8]:
# Dataframe

# list of values for a key
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"],
}

print(data)

df = pd.DataFrame(data)
print(df)
print(type(df))

{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Los Angeles', 'Chicago']}
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
<class 'pandas.core.frame.DataFrame'>

In [9]:
# list of dictionaries

data2 = [
    {"Name": "Alice", "Age": 25, "City": "New York"},
    {"Name": "Bob", "Age": 30, "City": "Los Angeles "},
    {"Name": "Charlie", "Age": 35, "City": "Chicago"},
]
df2 = pd.DataFrame(data2)
print(df2)
print(type(df2))

      Name  Age          City
0    Alice   25      New York
1      Bob   30  Los Angeles
2  Charlie   35       Chicago
<class 'pandas.core.frame.DataFrame'>

In [12]:
# from csv file

df3 = pd.read_csv("sales_data.csv")
print(df3)

     Transaction ID        Date Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
0          1999.98  North America    Credit Card
1           499.99         Europe         PayPal
2           209.97           Asia     Debit Card
3            63.96  North America    Credit Card
4            89.99         Europe         PayPal
..             ...            ...            ...
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

[240 rows x 9 columns]

In [25]:
# first 3 rows
print(df3.head(3))

   Transaction ID        Date Product Category      Product Name  Units Sold  \
0           10001  2024-01-01      Electronics     iPhone 14 Pro           2
1           10002  2024-01-02  Home Appliances  Dyson V11 Vacuum           1
2           10003  2024-01-03         Clothing  Levi's 501 Jeans           3

   Unit Price  Total Revenue         Region Payment Method
0      999.99        1999.98  North America    Credit Card
1      499.99         499.99         Europe         PayPal
2       69.99         209.97           Asia     Debit Card

In [15]:
df3["Date"] # print columns as series

0      2024-01-01
1      2024-01-02
2      2024-01-03
3      2024-01-04
4      2024-01-05
          ...
235    2024-08-23
236    2024-08-24
237    2024-08-25
238    2024-08-26
239    2024-08-27
Name: Date, Length: 240, dtype: object

In [ ]:
df3.loc[0] # first row as series from index label

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [ ]:
df3.iloc[0] # first row as series from integer position

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [ ]:
df3.iloc[0][2] # cell

/tmp/ipykernel_52577/1814316564.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df3.iloc[0][2]

'Electronics'

In [22]:
df3.at[0, "Date"] # cell by index label

'2024-01-01'

In [26]:
df3.iat[0, 2] # cell by integer position

'Electronics'

In [28]:
df3.columns # print columns

Index(['Transaction ID', 'Date', 'Product Category', 'Product Name',
       'Units Sold', 'Unit Price', 'Total Revenue', 'Region',
       'Payment Method'],
      dtype='object')

In [31]:
df3['status'] = df3['Units Sold'].apply(lambda x: 'High' if x > 100 else 'Low')

In [33]:
df3["status"].head()

0    Low
1    Low
2    Low
3    Low
4    Low
Name: status, dtype: object

In [34]:
df3.drop('status', axis=1, inplace=True) # drop column

In [35]:
df3.columns

Index(['Transaction ID', 'Date', 'Product Category', 'Product Name',
       'Units Sold', 'Unit Price', 'Total Revenue', 'Region',
       'Payment Method'],
      dtype='object')

In [36]:
df3.describe() # summary statistics

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000